/*=============================================================================
  @file sns_diag_service.c

  Manages Diagnostic Services for Sensors and Sensor Instances

  Copyright (c) 2016-2018 Qualcomm Technologies, Inc.
  All Rights Reserved.
  Confidential and Proprietary - Qualcomm Technologies, Inc.
  ===========================================================================*/

/*=============================================================================
  Include Files
  ===========================================================================*/

#include <stdarg.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "pb_encode.h"
#include "sns_assert.h"
#include "sns_attribute_service.h"
#include "sns_cstruct_extn.h"
#include "sns_diag.pb.h"
#include "sns_diag_print.h"
#include "sns_diag_service.h"
#include "sns_fw_attribute_service.h"
#include "sns_fw_diag_service.h"
#include "sns_fw_diag_types.h"
#include "sns_fw_event_service.h"
#include "sns_fw_sensor.h"
#include "sns_fw_sensor_instance.h"
#include "sns_island.h"
#include "sns_island_util.h"
#include "sns_log.h"
#include "sns_log_codes.h"
#include "sns_mem_util.h"
#include "sns_memmgr.h"
#include "sns_osa_lock.h"
#include "sns_osa_sem.h"
#include "sns_osa_thread.h"
#include "sns_pb_util.h"
#include "sns_printf_int.h"
#include "sns_pwr_scpm_mgr.h"
#include "sns_rc.h"
#include "sns_sensor_uid.h"
#include "sns_service.h"
#include "sns_thread_prio.h"
#include "sns_time.h"
#include "sns_types.h"

#include "sns_fw_log.h"
#include "sns_fw_request.h"

#define SNS_DIAG_LIST_SIZE_LIM          50
#define SNS_DIAG_LIST_LEN_UPPER_THRESH  200
#define SNS_DIAG_LIST_LEN_LOWER_THRESH  5

#define SNS_DIAG_MAX_ISLAND_ALLOC_SIZE 30*1024 // bytes
#define SNS_DIAG_ISLAND_REENTRY_ALLOC_SIZE ((size_t)(0.5 * SNS_DIAG_MAX_ISLAND_ALLOC_SIZE))

#define SNS_DIAG_ASYNC_LOG_CIRC_BUFFER_SIZE 12
#define SNS_DIAG_ASYNC_LOG_CIRC_BUFFER_MIN_EVENTS_TO_DRAIN 10

/* Drop log packets in DIAG Service when remaining free memory is below this */
#define SNS_DIAG_SERVICE_BUFFER_LOW_MEM (SNS_FW_EVENT_SERVICE_BUFFER_LOW_MEM_CB_THRESH + (100 * 1024))

/*  
* Diag allows maximum 244 bytes including diag log header in island.
* Diag log header packet length is 12 bytes and diag service additional fields length is ~53.
* The maximum permitted log size that sensors - algos / drivers are allowed to
* allocate 178 bytes in island and 1600 bytes in non-island.
*/
#define SNS_DIAG_IN_ISLAND_MAX_SENSOR_LOG_SIZE (178) // bytes

#define SNS_DIAG_NON_ISLAND_MAX_SENSOR_LOG_SIZE (1600) // bytes

/* The SUID used by the dummy sensor used by diag to refer to all framework operations */
// TODO: Remove this when we have a real framework sensor
#define FW_SUID {  \
    .sensor_uid =  \
      {  \
        0x1 ,0x2 ,0x3 ,0x4 ,0x5 ,0x6 ,0x7 ,0x8 ,  \
        0x9 ,0xa ,0xb ,0xc ,0xd ,0xe ,0xf ,0x0  \
      }  \
  }

// Uncomment to enable debug messages for Diag
//#define SNS_DIAG_ENABLE_DEBUG

/*=============================================================================
  Forward Declarations
  ===========================================================================*/

/*=============================================================================
  Type Definitions
  ===========================================================================*/

/**
 * Private state used by the Framework for the Diag manager.
 */
typedef struct sns_fw_diag_service
{
  sns_diag_service service;

  /* List of type sns_diag_datatype_config of discovered sensor
     data types and whether they are enabled or disabled */
  sns_list datatypes;
  /* List of datatypes that have some updates to be processed */
  sns_list config_move_queue;
  /* Lock that protects datatypes and config_move_queue */
  sns_osa_lock *data_type_list_lock;

  size_t encoded_sensor_api_hdr_size;
  size_t encoded_client_api_hdr_size;
  size_t encoded_island_transition;

  // total outstanding diag allocation in heap in bytes
  size_t island_alloc_size;
  size_t main_alloc_size;

  sns_island_client_handle island_client;

  // Client for SCPM voting
  sns_scpm_mgr_client *pwr_client;

  // Circular buffer
  sns_diag_async_log_item circ_buffer[SNS_DIAG_ASYNC_LOG_CIRC_BUFFER_SIZE];
  sns_osa_lock *circ_buffer_idx_lock;
  uint8_t circ_buffer_read_idx;
  uint8_t circ_buffer_write_idx;
  uint8_t circ_buffer_pending_cnt;

  // Number of dropped log packets due to inability to malloc
  uint64_t num_dropped_logs;

  // Number of log packets dropped at diag layer
  uint32_t num_diag_dropped_logs;
} sns_fw_diag_service;

typedef struct
{
  sns_diag_datatype_config *old;
  sns_diag_datatype_config *new;
}sns_diag_config_move;

typedef struct
{
  size_t array_len;
  sns_diag_config_move *array;
}sns_diag_config_move_arg;

/*=============================================================================
  Static Data Definitions
  ===========================================================================*/
// Diag Service API
static sns_diag_service_api diag_service_api SNS_SECTION(".data.sns");
// Diag Service
static sns_fw_diag_service diag_service SNS_SECTION(".data.sns");

// Diag Thread
static sns_osa_thread *sns_diag_thread SNS_SECTION(".data.sns");

// List that stores log packets to be submitted in diag thread
static sns_isafe_list sns_diag_list SNS_SECTION(".data.sns");

// Lock on sns_diag_list
static sns_osa_lock *sns_diag_lock SNS_SECTION(".data.sns");

// Semaphor used by diag thread
static sns_osa_sem *sns_diag_sem SNS_SECTION(".data.sns");

// SUID used by the framework sensor (dummy sensor used by diag)
static const sns_sensor_uid fw_suid SNS_SECTION(".rodata.sns") = FW_SUID;

// Default datatype config for uninitialized sensors
sns_diag_datatype_config *default_datatype SNS_SECTION(".data.sns") = NULL;

// PEND: Need to make this an actual Sensor
static sns_fw_sensor fw_printf_sensor SNS_SECTION(".data.sns");

/*=============================================================================
  Global Data Definitions
  ===========================================================================*/
sns_sensor *sns_fw_printf SNS_SECTION(".data.sns") = (sns_sensor *)&fw_printf_sensor;

/*=============================================================================
  Static Function Definitions
  ===========================================================================*/

/**
 * Find a datatype
 *
 * @param[i] datatype    Data type to be found
 *
 * @return sns_diag_datatype_config*
 */
static sns_diag_datatype_config *sns_diag_find_datatype(const char *datatype)
{
  sns_list_iter iter;
  sns_list_item *diag_config_item;
  sns_diag_datatype_config *ret_val = NULL;
  sns_osa_lock_acquire(diag_service.data_type_list_lock);
  for(diag_config_item = sns_list_iter_init(&iter, &diag_service.datatypes, true);
      NULL != diag_config_item;
      diag_config_item = sns_list_iter_advance(&iter))
  {
    sns_diag_datatype_config *curr = (sns_diag_datatype_config *)sns_list_item_get_data(diag_config_item);
    if(0 == strcmp(datatype, curr->datatype))
    {
      ret_val = curr;
      break;
    }
  }
  sns_osa_lock_release(diag_service.data_type_list_lock);
  #ifdef SNS_DIAG_ENABLE_DEBUG
    SNS_SPRINTF(HIGH, sns_fw_printf, "Found %s at 0x" SNS_DIAG_PTR " ",
                datatype, ret_val);
  #endif
  return ret_val;
}

/**
 * Add a new datatype
 *
 * @param[i] datatype  The datatype to be recorded
 * @param[i] island    If the datatype is to be permanently
 *                       stored in island mode
 *
 * @return sns_diag_datatype_config*
 */
static sns_diag_datatype_config *sns_diag_add_datatype(const char *datatype, bool island)
{
  sns_list_iter iter;
  sns_mem_heap_id heap = island ? SNS_HEAP_ISLAND : SNS_HEAP_MAIN;
  sns_diag_datatype_config *config = sns_diag_find_datatype(datatype);

  sns_osa_lock_acquire(diag_service.data_type_list_lock);
  if(NULL == config)
  {
    config = sns_malloc(heap, sizeof(sns_diag_datatype_config));
    SNS_ASSERT(NULL != config);

    sns_strlcpy(config->datatype, datatype, SNS_SENSOR_DATATYPE_NAME_LEN);
    sns_list_item_init(&config->datatypes_list_entry, config);
    sns_list_item_init(&config->config_move_entry, config);

    config->island_cnt = 0;
    config->enabled = true;
    config->disable_moving = island;
    config->vprintf_fptr = sns_diag_vprintf_v2;

    sns_list_iter_init(&iter, &diag_service.datatypes, true);
    sns_list_iter_insert(&iter, &config->datatypes_list_entry, false);
  }
  sns_osa_lock_release(diag_service.data_type_list_lock);

  return config;
}
/**
 * Return proper diag log size based on island/non-island mode
 */

SNS_SECTION(".text.sns")static uint32_t
sns_diag_get_sensor_max_log_size(void)
{
  uint32_t log_size = 0;
  if(SNS_ISLAND_STATE_IN_ISLAND == sns_island_get_island_state())
  {
    log_size = SNS_DIAG_IN_ISLAND_MAX_SENSOR_LOG_SIZE;
  }
  else
  {
    log_size = SNS_DIAG_NON_ISLAND_MAX_SENSOR_LOG_SIZE;
  }
  return log_size;
}

/**
 * Find and return the Qualcomm diag log id used to commit the log
 */
SNS_SECTION(".text.sns") static uint32_t
sns_diag_get_diag_log_id(sns_fw_diag_service_log_id log_id)
{
  if(log_id == SNS_LOG_CLIENT_API_REQUEST)
  {
    #ifdef LOG_SNS_CLIENT_API_REQUEST
      return LOG_SNS_CLIENT_API_REQUEST;
    #else
    return LOG_SNS_SMR_REQUEST_C; //0x14F3
    #endif
  }
  else if(log_id == SNS_LOG_CLIENT_API_RESPONSE)
  {
    #ifdef LOG_SNS_CLIENT_API_RESPONSE
      return LOG_SNS_CLIENT_API_RESPONSE;
    #else
    return LOG_SNS_SMR_RESPONSE_C; //0x14F4
    #endif
  }
  else if(log_id == SNS_LOG_CLIENT_API_EVENT)
  {
    #ifdef LOG_SNS_CLIENT_API_EVENT
      return LOG_SNS_CLIENT_API_EVENT;
    #else
    return LOG_SNS_SMR_INDICATION_C; //0x14F5
    #endif
  }
  else if(log_id == SNS_LOG_SENSOR_API_REQUEST)
  {
    #ifdef LOG_SNS_SENSOR_API_REQUEST
      return LOG_SNS_SENSOR_API_REQUEST;
    #else
    return LOG_SNS_SENSOR1_REQUEST_C; //0x14F0
    #endif
  }
  else if(log_id == SNS_LOG_SENSOR_API_EVENT)
  {
    #ifdef LOG_SNS_SENSOR_API_EVENT
      return LOG_SNS_SENSOR_API_EVENT;
    #else
    return LOG_SNS_SENSOR1_INDICATION_C; //0x14F2
    #endif
  }
  else if(log_id == SNS_LOG_SENSOR_STATE_RAW_INT)
  {
    #ifdef LOG_SNS_SENSOR_STATE_INT
      return LOG_SNS_SENSOR_STATE_INT;
    #else
    return LOG_SNS_QMD_RESULT_C; //0x151E
    #endif
  }
  else if(log_id == SNS_LOG_SENSOR_STATE_INTERNAL_INT ||
          log_id == SNS_LOG_QSOCKET_CLIENT_API)
  {
    #ifdef LOG_SNS_SENSOR_STATE_INT
      return LOG_SNS_SENSOR_STATE_INT;
    #else
    return LOG_SNS_QMD_RESULT_C; //0x151E
    #endif
  }
  else if(log_id == SNS_LOG_SENSOR_STATE_RAW_EXT)
  {
    #ifdef LOG_SNS_SENSOR_STATE_EXT
      return LOG_SNS_SENSOR_STATE_EXT;
    #else
    return LOG_SNS_SENSOR1_RESPONSE_C; //0x14F1
    #endif
  }
  else if(log_id == SNS_LOG_SENSOR_STATE_INTERNAL_EXT)
  {
    #ifdef LOG_SNS_SENSOR_STATE_EXT
      return LOG_SNS_SENSOR_STATE_EXT;
    #else
    return LOG_SNS_SENSOR1_RESPONSE_C; //0x14F1
    #endif
  }
  else if(log_id == SNS_LOG_SENSOR_STATE_INTERRUPT)
  {
    #ifdef LOG_SNS_HW_INTERRUPT
      return LOG_SNS_HW_INTERRUPT;
    #else
    return LOG_SNS_DRV_MD_IRQ_C; //0x1559
    #endif
  }
  else if(log_id == SNS_LOG_INSTANCE_MAP)
  {
    #ifdef LOG_SNS_INSTANCE_MAP
      return LOG_SNS_INSTANCE_MAP;
    #else
    return LOG_SENSORS_SDP_INTERNAL; //0x151A
    #endif
  }
  else if(log_id == SNS_LOG_ISLAND_TRANSITION)
  {
    #ifdef LOG_ISLAND_TRANSITION_C
      return LOG_ISLAND_TRANSITION_C;
    #else
      return LOG_SENSORS_SDP_INTERNAL; //0x151A
    #endif
  }
  else if(log_id == SNS_LOG_ISLAND_EXIT_VOTE)
  {
    #ifdef LOG_ISLAND_EXIT_VOTE_C
      return LOG_ISLAND_EXIT_VOTE_C;
    #else
      return LOG_SENSORS_SDP_INTERNAL; //0x151A
    #endif
  }
  else if(log_id == SNS_LOG_MEMORY_UTILIZATION)
  {
    #ifdef LOG_MEMORY_UTILIZATION_C
      return LOG_MEMORY_UTILIZATION_C;
    #else
      return LOG_SENSORS_SDP_INTERNAL; //0x151A
    #endif
  }
  else
  {
     return 0;
  }
}

/**
 * Translate sns_diag_sensor_state_log to sns_fw_diag_service_log_id
 */
SNS_SECTION(".text.sns")static sns_fw_diag_service_log_id
sns_diag_get_sensor_state_log_id(sns_diag_sensor_state_log log_type,
                                 uint32_t debug_ssid)
{
  sns_fw_diag_service_log_id log_id = SNS_DIAG_SENSOR_STATE_LOG_NUM;

  if(SNS_DIAG_SENSOR_STATE_LOG_INTERNAL == log_type)
  {
    log_id = (MSG_SSID_SNS == debug_ssid ||
              MSG_SSID_SNS_FRAMEWORK == debug_ssid ||
              MSG_SSID_SNS_PLATFORM == debug_ssid ||
              MSG_SSID_SNS_SENSOR_INT == debug_ssid) ?
       SNS_LOG_SENSOR_STATE_INTERNAL_INT : SNS_LOG_SENSOR_STATE_INTERNAL_EXT;
  }
  else if(SNS_DIAG_SENSOR_STATE_LOG_RAW == log_type)
  {
    log_id = (MSG_SSID_SNS == debug_ssid ||
              MSG_SSID_SNS_FRAMEWORK == debug_ssid ||
              MSG_SSID_SNS_PLATFORM == debug_ssid ||
